bench/results/redis/fsA_mt_r1-1_d100_P1.out
Json file fsA_mt_r1-1_d100_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     3207706 ops,  155659 (avg:  160383) ops/sec, 21.10MB/sec (avg: 20.06MB/sec),  0.05 (avg:  0.05) msec latency

warning: GET miss rate 23.56% above target 1.00% (377807 misses / 1603850 ops)

CPU Utilization Summary
  Total CPU time:   32.340s  (user 12.234s, sys 20.106s)
  Wall time:        20.001s
  Cores used:       1.617   (avg 80.8% across 2 worker threads)
  Peak utilization: 163.7%
Saving JSON output file: fsA_mt_r1-1_d100_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        80191.74          ---          ---         0.05001         0.05500         0.07900         0.08700     11416.23 
Gets        80191.44     61301.34     18890.10         0.04883         0.05500         0.07100         0.08700      9124.50 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     160383.18     61301.34     18890.10         0.04942         0.05500         0.07900         0.08700     20540.74