bench/results/redis/fsA_mt_r1-1_d100_P16.out
Json file fsA_mt_r1-1_d100_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:    12259360 ops,  599307 (avg:  612961) ops/sec, 81.89MB/sec (avg: 83.60MB/sec),  0.21 (avg:  0.20) msec latency


CPU Utilization Summary
  Total CPU time:   17.755s  (user 11.973s, sys 5.782s)
  Wall time:        20.001s
  Cores used:       0.888   (avg 44.4% across 2 worker threads)
  Peak utilization: 95.7%
Saving JSON output file: fsA_mt_r1-1_d100_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets       306479.77          ---          ---         0.20474         0.21500         0.31900         0.35100     43630.98 
Gets       306479.77    304908.34      1571.43         0.20474         0.21500         0.31900         0.35100     41976.27 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     612959.54    304908.34      1571.43         0.20474         0.21500         0.31900         0.35100     85607.24