bench/results/redis/fsA_mt_r1-1_d1024_P1.out
Json file fsA_mt_r1-1_d1024_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     3559302 ops,  175178 (avg:  177963) ops/sec, 177.45MB/sec (avg: 164.57MB/sec),  0.04 (avg:  0.04) msec latency


CPU Utilization Summary
  Total CPU time:   35.679s  (user 14.943s, sys 20.736s)
  Wall time:        20.001s
  Cores used:       1.784   (avg 89.2% across 2 worker threads)
  Peak utilization: 180.5%
Saving JSON output file: fsA_mt_r1-1_d1024_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        88981.61          ---          ---         0.04467         0.04700         0.07100         0.09500     93046.44 
Gets        88981.41     88981.41         0.00         0.04392         0.04700         0.07100         0.09500     75478.03 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     177963.02     88981.41         0.00         0.04430         0.04700         0.07100         0.09500    168524.47