bench/results/redis/fsA_mt_r1-9_d100_P1.out
Json file fsA_mt_r1-9_d100_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     3257099 ops,  163815 (avg:  162852) ops/sec, 82.62MB/sec (avg: 109.74MB/sec),  0.05 (avg:  0.05) msec latency


CPU Utilization Summary
  Total CPU time:   32.577s  (user 12.305s, sys 20.273s)
  Wall time:        20.001s
  Cores used:       1.629   (avg 81.4% across 2 worker threads)
  Peak utilization: 165.0%
Saving JSON output file: fsA_mt_r1-9_d100_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        16285.39          ---          ---         0.04870         0.05500         0.07900         0.09500      2318.39 
Gets       146567.43    146567.43         0.00         0.04854         0.04700         0.07900         0.09500    110051.53 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     162852.82    146567.43         0.00         0.04855         0.04700         0.07900         0.09500    112369.93