bench/results/redis/fsA_mt_r1-9_d100_P16.out
Json file fsA_mt_r1-9_d100_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:    10403232 ops,  582983 (avg:  520152) ops/sec, 119.93MB/sec (avg: 183.81MB/sec),  0.21 (avg:  0.24) msec latency


CPU Utilization Summary
  Total CPU time:   21.814s  (user 10.824s, sys 10.989s)
  Wall time:        20.001s
  Cores used:       1.091   (avg 54.5% across 2 worker threads)
  Peak utilization: 130.4%
Saving JSON output file: fsA_mt_r1-9_d100_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        52015.49          ---          ---         0.24185         0.25500         0.39900         0.46300      7405.03 
Gets       468137.38    468137.38         0.00         0.24271         0.25500         0.40700         0.47100    180819.71 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     520152.87    468137.38         0.00         0.24262         0.25500         0.40700         0.47100    188224.74