bench/results/redis/fsA_mt_r1-9_d1024_P1.out
Json file fsA_mt_r1-9_d1024_P1.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     3359821 ops,  164144 (avg:  167989) ops/sec, 117.87MB/sec (avg: 90.78MB/sec),  0.05 (avg:  0.05) msec latency


CPU Utilization Summary
  Total CPU time:   32.969s  (user 12.364s, sys 20.605s)
  Wall time:        20.001s
  Cores used:       1.648   (avg 82.4% across 2 worker threads)
  Peak utilization: 167.7%
Saving JSON output file: fsA_mt_r1-9_d1024_P1.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        16799.04          ---          ---         0.04966         0.05500         0.07900         0.09500     17566.43 
Gets       151189.95    151189.95         0.00         0.04739         0.04700         0.07900         0.09500     75392.32 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     167988.99    151189.95         0.00         0.04761         0.04700         0.07900         0.09500     92958.75