bench/results/redis/fsA_mt_r1-9_d1024_P16.out
Json file fsA_mt_r1-9_d1024_P16.json created...
Writing results to stdout
[RUN #1] Preparing benchmark client...
[RUN #1] Launching threads now...
[RUN #1 100%,  20 secs]  0 threads  4 conns:     8124390 ops,  369514 (avg:  406213) ops/sec, 353.52MB/sec (avg: 333.39MB/sec),  0.34 (avg:  0.31) msec latency


CPU Utilization Summary
  Total CPU time:   28.645s  (user 12.611s, sys 16.034s)
  Wall time:        20.001s
  Cores used:       1.432   (avg 71.6% across 2 worker threads)
  Peak utilization: 151.3%
Saving JSON output file: fsA_mt_r1-9_d1024_P16.json
Json file closed.
2         Threads
4         Connections per thread
20        Seconds


ALL STATS
============================================================================================================================
Type         Ops/sec     Hits/sec   Misses/sec    Avg. Latency     p50 Latency     p99 Latency   p99.9 Latency       KB/sec 
----------------------------------------------------------------------------------------------------------------------------
Sets        40621.05          ---          ---         0.31304         0.31100         0.46300         0.55100     42476.70 
Gets       365587.34    365587.34         0.00         0.31387         0.31100         0.46300         0.55100    298908.69 
Waits           0.00          ---          ---             ---             ---             ---             ---          --- 
Totals     406208.39    365587.34         0.00         0.31379         0.31100         0.46300         0.55100    341385.39